In [23]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [24]:
sns.load_dataset('flights')

     year month  passengers
0    1949   Jan         112
1    1949   Feb         118
2    1949   Mar         132
3    1949   Apr         129
4    1949   May         121
..    ...   ...         ...
139  1960   Aug         606
140  1960   Sep         508
141  1960   Oct         461
142  1960   Nov         390
143  1960   Dec         432

[144 rows x 3 columns]

In [25]:
df = sns.load_dataset('flights')

In [26]:
df

     year month  passengers
0    1949   Jan         112
1    1949   Feb         118
2    1949   Mar         132
3    1949   Apr         129
4    1949   May         121
..    ...   ...         ...
139  1960   Aug         606
140  1960   Sep         508
141  1960   Oct         461
142  1960   Nov         390
143  1960   Dec         432

[144 rows x 3 columns]

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144 entries, 0 to 143
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   year        144 non-null    int64
 1   month       144 non-null    category
 2   passengers  144 non-null    int64
dtypes: category(1), int64(2)
memory usage: 2.9 KB

In [28]:
df = sns.load_dataset('flights')

In [29]:
df

     year month  passengers
0    1949   Jan         112
1    1949   Feb         118
2    1949   Mar         132
3    1949   Apr         129
4    1949   May         121
..    ...   ...         ...
139  1960   Aug         606
140  1960   Sep         508
141  1960   Oct         461
142  1960   Nov         390
143  1960   Dec         432

[144 rows x 3 columns]

In [30]:
# Sample data with mixed date formats
data = {
    'id': [1, 2, 3, 4, 5, 6],
    'raw_date': [
        '2025-10-06',     # ISO format
        '06/10/2025',     # European format (DD/MM/YYYY)
        '10/06/2025',     # US format (MM/DD/YYYY)
        'October 6, 2025',# Full month name
        '06-Oct-2025',    # Abbreviated month
        '20251006'        # Compact YYYYMMDD
    ]
}

# Create DataFrame
df = pd.DataFrame(data)
print(df)

   id         raw_date
0   1       2025-10-06
1   2       06/10/2025
2   3       10/06/2025
3   4  October 6, 2025
4   5      06-Oct-2025
5   6         20251006

In [31]:
df

   id         raw_date
0   1       2025-10-06
1   2       06/10/2025
2   3       10/06/2025
3   4  October 6, 2025
4   5      06-Oct-2025
5   6         20251006

In [32]:
pd.to_datetime(df['raw_date'], errors='coerce')

0   2025-10-06
1          NaT
2          NaT
3          NaT
4          NaT
5          NaT
Name: raw_date, dtype: datetime64[ns]

In [33]:
a = pd.to_datetime(df["raw_date"][1:2], format='mixed')

In [34]:
a.dt

In [35]:
a.dt.year

1    2025
Name: raw_date, dtype: int32

In [36]:
a.dt.month

1    6
Name: raw_date, dtype: int32

In [37]:
a.dt.month_name()

1    June
Name: raw_date, dtype: object

In [38]:
# Sample sales data
data = {
    'sale_id': [101, 102, 103, 104, 105],
    'product': ['Widget', 'Gadget', 'Widget', 'Thingy', 'Gadget'],
    'quantity': [3, 5, 2, 7, 1],
    'price_per_unit': [20.0, 15.5, 20.0, 10.0, 15.5],
    'sale_date': [
        '2025-10-01',
        '2025-10-02',
        '2025-10-03',
        '2025-10-03',
        '2025-10-04'
    ]
}

# Create DataFrame
df = pd.DataFrame(data)

# Calculate total

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   sale_id         5 non-null      int64
 1   product         5 non-null      object
 2   quantity        5 non-null      int64
 3   price_per_unit  5 non-null      float64
 4   sale_date       5 non-null      object
dtypes: float64(1), int64(2), object(2)
memory usage: 332.0+ bytes

In [40]:
df['order_date'] = pd.to_datetime(df['sale_date'])

In [41]:
df

   sale_id product  quantity  price_per_unit   sale_date order_date
0      101  Widget         3            20.0  2025-10-01 2025-10-01
1      102  Gadget         5            15.5  2025-10-02 2025-10-02
2      103  Widget         2            20.0  2025-10-03 2025-10-03
3      104  Thingy         7            10.0  2025-10-03 2025-10-03
4      105  Gadget         1            15.5  2025-10-04 2025-10-04

In [42]:
df['order_date'].dt.day_name()

0    Wednesday
1     Thursday
2       Friday
3       Friday
4     Saturday
Name: order_date, dtype: object

In [43]:
df.groupby(df['order_date'].dt.day_name()).sum('price_per_unit')

            sale_id  quantity  price_per_unit
order_date
Friday          207         9            30.0
Saturday        105         1            15.5
Thursday        102         5            15.5
Wednesday       101         3            20.0